Repository: MuhammedBashuaib/flutter_task
Catalog: lib/core/l10n/intl_*.arb
Languages: ar

# title
source: Learn Language C++
ar: تعلم لغة ++C

# Solutions
source: Training With Solutions
ar: تدريبات مع الحلول

source: Basecs
ar: الاساسيات

source: Code translator
ar: مترجم اكواد

# opp
source: Object Programming
ar: البرمجة الكائنية

source: Introduction
ar: مقدمة عن البرمجة

source: Why Start in C++
ar: لماذا البداية بلغة السي بلس بلس

source: Comments
ar: التعليقات

source: OutPut
ar: الطباعة

source: Variables
ar: المتغيرات

source: Inputs
ar: المدخلات

source: Arithmeitc Operations
ar: العمليات الرياضية

source: Logic operations
ar: العمليات المنطقية

source: Condition statement
ar: الجمل الشرطية

source: Loops
ar: الحلقات التكرارية

source: Arrays
ar: المصفوفات

source: Functions
ar: الدوال

# IntroductionOpp
source: Introduction
ar: مقدمة

source: Classes and Objects
ar: الكلاسات والكائنات

source: Encapsulation
ar: التغليف

source: Inheritance
ar: التوريث

source: Polymorphism
ar: تعدد الأشكال

source: Interfaces
ar: الواجهات
